In [1]:
import pandas as pd
import catboost

ModuleNotFoundError: No module named 'catboost'

In [2]:
df = pd.read_csv('train.csv')
len(df)

/home/gionata/anaconda3/lib/python3.7/site-packages/IPython/core/interactiveshell.py:2785: DtypeWarning: Columns (8) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

3180576

In [3]:
df.head(5)

,order_id,detail_id,store_id,store_name,store_area,courier_id,courier_orders,courier_days,ref_id,ean,...,category_id,category_name,type,price,variable_weight,status,touched_at,first_detail_picked_at,paid_at,delivered_at
0,362909,5840217,342949,simply,RM3,104372,24,24,51378862,8.000430e+12,...,293.0,Gorgonzola,3,3.48,0,PURCHASED,2017-10-20 09:41:57,2017-10-20 09:41:57,2017-10-20 10:17:37,2017-10-20 10:26:36
1,362909,5840237,342949,simply,RM3,104372,24,24,28894705,3.073781e+12,...,291.0,Fusi/A fette,3,2.85,0,PURCHASED,2017-10-20 09:42:35,2017-10-20 09:41:57,2017-10-20 10:17:37,2017-10-20 10:26:36
2,362909,5840219,342949,simply,RM3,104372,24,24,62680388,8.002580e+12,...,321.0,Latte fresco,4,2.40,0,PURCHASED,2017-10-20 09:46:14,2017-10-20 09:41:57,2017-10-20 10:17:37,2017-10-20 10:26:36
3,362909,5840225,342949,simply,RM3,104372,24,24,28896339,8.000121e+12,...,426.0,Zucchero,3,1.77,0,PURCHASED,2017-10-20 09:53:48,2017-10-20 09:41:57,2017-10-20 10:17:37,2017-10-20 10:26:36
4,362909,5840215,342949,simply,RM3,104372,24,24,67787005,4.000000e+12,...,206.0,Pollo,3,5.39,1,PURCHASED,2017-10-20 09:54:49,2017-10-20 09:41:57,2017-10-20 10:17:37,2017-10-20 10:26:36

In [5]:
# use fewer records to experiment
df = df.tail(5000)

In [6]:
df.columns

Index(['order_id', 'detail_id', 'store_id', 'store_name', 'store_area',
       'courier_id', 'courier_orders', 'courier_days', 'ref_id', 'ean', 'name',
       'category_id', 'category_name', 'type', 'price', 'variable_weight',
       'status', 'touched_at', 'first_detail_picked_at', 'paid_at',
       'delivered_at'],
      dtype='object')

In [ ]:
df2 = df.copy()

for index, row in df.iterrows():
    if i > 0 and row['order_id'] == df['order_id', index-1]: